package main

import (
	"fmt"
	"net"
	"time"
	"strconv"
)

func checkError(err error) {
	if err != nil {
		fmt.Println("Error: ", err)
	}
}

func main() {
	ServerAddr,err := net.ResolveUDPAddr("udp", "127.0.0.1:1337")
	checkError(err)

	LocalAddr,err := net.ResolveUDPAddr("udp", "127.0.0.1:0")
	checkError(err)

	Conn, err := net.DialUDP("udp", LocalAddr, ServerAddr)
	checkError(err)

	defer Conn.Close()
	i := 0
	for {
		msg := "Hellow server, send messege" +
			"1 аааааааааааааааааааааааааааааааааааааааа " +
			"2 аааааааааааааааааааааааааааааааааааааааа " +
			"3 аааааааааааааааааааааааааааааааааааааааа " +
			"4 аааааааааааааааааааааааааааааааааааааааа " +
			"5 аааааааааааааааааааааааааааааааааааааааа " +
			"6 аааааааааааааааааааааааааааааааааааааааа " +
			"7 аааааааааааааааааааааааааааааааааааааааа " +
			"8 аааааааааааааааааааааааааааааааааааааааа " +
			"9 аааааааааааааааааааааааааааааааааааааааа " +
			"10 аааааааааааааааааааааааааааааааааааааааа " +
			"11 аааааааааааааааааааааааааааааааааааааааа" +
			"12 аааааааааааааааааааааааааааааааааааааааа " +
			"13 аааааааааааааааааааааааааааааааааааааааа " +
			"14 аааааааааааааааааааааааааааааааааааааааа " +
			"15 аааааааааааааааааааааааааааааааааааааааа " +
			"16 аааааааааааааааааааааааааааааааааааааааа " +
			"17 аааааааааааааааааааааааааааааааааааааааа " +
			"18 аааааааааааааааааааааааааааааааааааааааа " +
			"19 аааааааааааааааааааааааааааааааааааааааа " +
			"20 аааааааааааааааааааааааааааааааааааааааа " +
			"21 аааааааааааааааааааааааааааааааааааааааа " +
			"22 аааааааааааааааааааааааааааааааааааааааа " +
			"23 аааааааааааааааааааааааааааааааааааааааа " +
			"24 аааааааааааааааааааааааааааааааааааааааа " +
			"25 аааааааааааааааааааааааааааааааааааааааа " +
			"26 аааааааааааааааааааааааааааааааааааааааа " +
			"27 аааааааааааааааааааааааааааааааааааааааа " +
			"28 аааааааааааааааааааааааааааааааааааааааа " +
			"29 аааааааааааааааааааааааааааааааааааааааа " +
			"30 аааааааааааааааааааааааааааааааааааааааа " +
			"31 аааааааааааааааааааааааааааааааааааааааа " +
			"#" + strconv.Itoa(i)

		i++
		buf := 	[]byte(msg)
		_,err := Conn.Write(buf)
		if err != nil {
			fmt.Println(msg, err)
		}
		time.Sleep(time.Second * 1)
	}
}
